
## Plan Result




<pre><code>Plan: 19 to add, 3 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.scheduler-db-password
  * module.fpl-scheduler-db.azurerm_postgresql_active_directory_administrator.admin
  * module.fpl-scheduler-db.azurerm_resource_group.data-resourcegroup
  * module.fpl-scheduler-db.azurerm_template_deployment.postgres-paas
  * module.fpl-scheduler-db.null_resource.subnet_mappings[0]
  * module.fpl-scheduler-db.null_resource.subnet_mappings[1]
  * module.fpl-scheduler-db.null_resource.subnet_mappings[2]
  * module.fpl-scheduler-db.null_resource.subnet_mappings[3]
  * module.fpl-scheduler-db.null_resource.subnet_mappings[4]
  * module.fpl-scheduler-db.null_resource.subnet_mappings[5]
  * module.fpl-scheduler-db.null_resource.subnet_mappings[6]
  * module.fpl-scheduler-db.null_resource.subnet_mappings[7]
  * module.fpl-scheduler-db.null_resource.subnet_mappings[8]
  * module.fpl-scheduler-db.null_resource.subnet_mappings[9]
  * module.fpl-scheduler-db.null_resource.subnet_mappings[10]
  * module.fpl-scheduler-db.null_resource.subnet_mappings[11]
  * module.fpl-scheduler-db.null_resource.subnet_mappings[12]
  * module.fpl-scheduler-db.null_resource.subnet_mappings[13]
  * module.fpl-scheduler-db.random_string.password
* Update
  * azurerm_key_vault_secret.update-summary-tab-cron
  * module.fpl-action-group.azurerm_resource_group_template_deployment.action-group
  * module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.scheduler-db-password will be created
  + resource "azurerm_key_vault_secret" "scheduler-db-password" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/fpl-case-service-aat/providers/Microsoft.KeyVault/vaults/fpl-aat"
      + name                    = "scheduler-db-password"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.update-summary-tab-cron will be updated in-place
  ~ resource "azurerm_key_vault_secret" "update-summary-tab-cron" {
        id                      = "https://fpl-aat.vault.azure.net/secrets/update-summary-tab-cron/610e9d1fb33f446c9b8ee86a6a49b90b"
        name                    = "update-summary-tab-cron"
      - not_before_date         = "2023-11-22T08:32:40Z" -> null
        tags                    = {}
        # (6 unchanged attributes hidden)
    }

  # module.fpl-action-group.azurerm_resource_group_template_deployment.action-group will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "action-group" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/fpl-case-service-aat/providers/Microsoft.Resources/deployments/fpl-support"
        name                = "fpl-support"
        tags                = {}
      ~ template_content    = jsonencode(
          ~ {
              ~ parameters     = {
                  ~ actionGroupName      = {
                      ~ type = "String" -> "string"
                    }
                  ~ emailReceiverAddress = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ emailReceiverName    = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location             = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ shortName            = {
                      ~ type = "String" -> "string"
                    }
                }
                # (3 unchanged attributes hidden)
            }
        )
        # (4 unchanged attributes hidden)
    }

  # module.fpl-scheduler-db.data.azurerm_postgresql_server.replica will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_postgresql_server" "replica" {
      + administrator_login = (known after apply)
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + identity            = (known after apply)
      + location            = (known after apply)
      + name                = "fpl-case-service-aat"
      + resource_group_name = "fpl-case-service-data-aat"
      + sku_name            = (known after apply)
      + tags                = (known after apply)
      + version             = (known after apply)
    }

  # module.fpl-scheduler-db.azurerm_postgresql_active_directory_administrator.admin will be created
  + resource "azurerm_postgresql_active_directory_administrator" "admin" {
      + id                  = (known after apply)
      + login               = "DTS Platform Operations"
      + object_id           = "e7ea2042-4ced-45dd-8ae3-e051c6551789"
      + resource_group_name = "fpl-case-service-data-aat"
      + server_name         = "fpl-case-service-aat"
      + tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.fpl-scheduler-db.azurerm_resource_group.data-resourcegroup will be created
  + resource "azurerm_resource_group" "data-resourcegroup" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "fpl-case-service-data-aat"
      + tags     = {
          + "application"         = "family-public-law"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/fpl-ccd-configuration.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#fpla-tech"
          + "environment"         = "staging"
          + "managedBy"           = "Family Public Law"
        }
    }

  # module.fpl-scheduler-db.azurerm_template_deployment.postgres-paas will be created
  + resource "azurerm_template_deployment" "postgres-paas" {
      + deployment_mode     = "Incremental"
      + id                  = (known after apply)
      + name                = "fpl-case-service-aat"
      + outputs             = (known after apply)
      + parameters          = (known after apply)
      + resource_group_name = "fpl-case-service-data-aat"
      + template_body       = jsonencode(
            {
              + "$schema"      = "http://schema.management.azure.com/schemas/2014-04-01-preview/deploymentTemplate.json#"
              + contentVersion = "1.0.0.0"
              + parameters     = {
                  + administratorLogin         = {
                      + maxLength = 16
                      + minLength = 1
                      + type      = "string"
                    }
                  + administratorLoginPassword = {
                      + type = "securestring"
                    }
                  + backupRetentionDays        = {
                      + defaultValue = 7
                      + type         = "string"
                    }
                  + charset                    = {
                      + type = "string"
                    }
                  + collation                  = {
                      + type = "string"
                    }
                  + commonTags                 = {
                      + type = "string"
                    }
                  + dbName                     = {
                      + type = "string"
                    }
                  + dbRules                    = {
                      + type = "string"
                    }
                  + env                        = {
                      + metadata = {
                          + description = "The tag"
                        }
                      + type     = "string"
                    }
                  + geoRedundantBackup         = {
                      + defaultValue = "Enabled"
                      + type         = "string"
                    }
                  + location                   = {
                      + allowedValues = [
                          + "UK West",
                          + "ukwest",
                          + "UK South",
                          + "uksouth",
                        ]
                      + defaultValue  = "UK South"
                      + type          = "string"
                    }
                  + serverName                 = {
                      + maxLength = 63
                      + minLength = 2
                      + type      = "string"
                    }
                  + skuCapacity                = {
                      + defaultValue = 2
                      + type         = "string"
                    }
                  + skuFamily                  = {
                      + allowedValues = [
                          + "Gen5",
                        ]
                      + defaultValue  = "Gen5"
                      + type          = "string"
                    }
                  + skuName                    = {
                      + allowedValues = [
                          + "B_Gen5_1",
                          + "B_Gen5_2",
                          + "GP_Gen5_2",
                          + "GP_Gen5_4",
                          + "GP_Gen5_8",
                          + "GP_Gen5_16",
                          + "GP_Gen5_32",
                          + "MO_Gen5_2",
                          + "MO_Gen5_4",
                          + "MO_Gen5_8",
                          + "MO_Gen5_16",
                          + "MO_Gen5_32",
                        ]
                      + defaultValue  = "GP_Gen5_2"
                      + type          = "string"
                    }
                  + skuSizeMB                  = {
                      + defaultValue = "51200"
                      + type         = "string"
                    }
                  + skuTier                    = {
                      + allowedValues = [
                          + "Basic",
                          + "GeneralPurpose",
                          + "MemoryOptimized",
                        ]
                      + defaultValue  = "GeneralPurpose"
                      + type          = "string"
                    }
                  + sslEnforcement             = {
                      + defaultValue = "Enabled"
                      + type         = "string"
                    }
                  + version                    = {
                      + allowedValues = [
                          + "9.5",
                          + "9.6",
                          + "10",
                          + "11",
                        ]
                      + defaultValue  = "9.6"
                      + type          = "string"
                    }
                }
              + resources      = [
                  + {
                      + apiVersion = "2017-12-01-preview"
                      + kind       = ""
                      + location   = "[parameters('location')]"
                      + name       = "[parameters('serverName')]"
                      + properties = {
                          + administratorLogin         = "[parameters('administratorLogin')]"
                          + administratorLoginPassword = "[parameters('administratorLoginPassword')]"
                          + sslEnforcement             = "[parameters('sslEnforcement')]"
                          + storageProfile             = {
                              + backupRetentionDays = "[int(parameters('backupRetentionDays'))]"
                              + geoRedundantBackup  = "[parameters('geoRedundantBackup')]"
                              + storageMB           = "[parameters('skuSizeMB')]"
                            }
                          + version                    = "[parameters('version')]"
                        }
                      + resources  = [
                          + {
                              + apiVersion = "2017-12-01-preview"
                              + dependsOn  = [
                                  + "[concat('Microsoft.DBforPostgreSQL/servers/', parameters('serverName'))]",
                                ]
                              + name       = "[parameters('dbName')]"
                              + properties = {
                                  + charset   = "[parameters('charset')]"
                                  + collation = "[parameters('collation')]"
                                }
                              + type       = "databases"
                            },
                        ]
                      + sku        = {
                          + capacity = "[parameters('skuCapacity')]"
                          + family   = "[parameters('skuFamily')]"
                          + name     = "[parameters('skuName')]"
                          + size     = "[parameters('skuSizeMB')]"
                          + tier     = "[parameters('skuTier')]"
                        }
                      + tags       = "[variables('tags')]"
                      + type       = "Microsoft.DBforPostgreSQL/servers"
                    },
                  + {
                      + apiVersion = "2017-12-01-preview"
                      + copy       = {
                          + count = "[length(variables('dbRules'))]"
                          + name  = "storagecopy"
                        }
                      + dependsOn  = [
                          + "[concat('Microsoft.DBforPostgreSQL/servers/', parameters('serverName'))]",
                        ]
                      + location   = "[parameters('location')]"
                      + name       = "[concat(parameters('serverName'), '/', variables('dbRules')[copyIndex()].rule_name)]"
                      + properties = {
                          + ignoreMissingVnetServiceEndpoint = true
                          + virtualNetworkSubnetId           = "[variables('dbRules')[copyIndex()].subnet_id]"
                        }
                      + type       = "Microsoft.DBforPostgreSQL/servers/virtualNetworkRules"
                    },
                ]
              + variables      = {
                  + dbRules = "[base64ToJson(parameters('dbRules'))]"
                  + tags    = "[base64ToJson(parameters('commonTags'))]"
                }
            }
        )
    }

  # module.fpl-scheduler-db.null_resource.subnet_mappings[0] will be created
  + resource "null_resource" "subnet_mappings" {
      + id       = (known after apply)
      + triggers = {
          + "rule_name" = "cftaks-tf-aks00"
          + "subnet_id" = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/virtualNetworks/cft-aat-vnet/subnets/aks-00"
        }
    }

  # module.fpl-scheduler-db.null_resource.subnet_mappings[1] will be created
  + resource "null_resource" "subnet_mappings" {
      + id       = (known after apply)
      + triggers = {
          + "rule_name" = "cftaks-tf-aks01"
          + "subnet_id" = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/virtualNetworks/cft-aat-vnet/subnets/aks-01"
        }
    }

  # module.fpl-scheduler-db.null_resource.subnet_mappings[2] will be created
  + resource "null_resource" "subnet_mappings" {
      + id       = (known after apply)
      + triggers = {
          + "rule_name" = "ase"
          + "subnet_id" = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-aat/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-aat/subnets/core-infra-subnet-3-aat"
        }
    }

  # module.fpl-scheduler-db.null_resource.subnet_mappings[3] will be created
  + resource "null_resource" "subnet_mappings" {
      + id       = (known after apply)
      + triggers = {
          + "rule_name" = "aks"
          + "subnet_id" = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-aat/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-aat/subnets/aks"
        }
    }

  # module.fpl-scheduler-db.null_resource.subnet_mappings[4] will be created
  + resource "null_resource" "subnet_mappings" {
      + id       = (known after apply)
      + triggers = {
          + "rule_name" = "jenkins-aks"
          + "subnet_id" = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-ptl-network-rg/providers/Microsoft.Network/virtualNetworks/cft-ptl-vnet/subnets/iaas"
        }
    }

  # module.fpl-scheduler-db.null_resource.subnet_mappings[5] will be created
  + resource "null_resource" "subnet_mappings" {
      + id       = (known after apply)
      + triggers = {
          + "rule_name" = "jenkins-aks-agent"
          + "subnet_id" = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-ptl-network-rg/providers/Microsoft.Network/virtualNetworks/cft-ptl-vnet/subnets/aks-00"
        }
    }

  # module.fpl-scheduler-db.null_resource.subnet_mappings[6] will be created
  + resource "null_resource" "subnet_mappings" {
      + id       = (known after apply)
      + triggers = {
          + "rule_name" = "shared-services-test-aks00"
          + "subnet_id" = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/virtualNetworks/ss-test-vnet/subnets/aks-00"
        }
    }

  # module.fpl-scheduler-db.null_resource.subnet_mappings[7] will be created
  + resource "null_resource" "subnet_mappings" {
      + id       = (known after apply)
      + triggers = {
          + "rule_name" = "shared-services-test-aks01"
          + "subnet_id" = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/virtualNetworks/ss-test-vnet/subnets/aks-01"
        }
    }

  # module.fpl-scheduler-db.null_resource.subnet_mappings[8] will be created
  + resource "null_resource" "subnet_mappings" {
      + id       = (known after apply)
      + triggers = {
          + "rule_name" = "shared-services-stg-aks00"
          + "subnet_id" = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/virtualNetworks/ss-stg-vnet/subnets/aks-00"
        }
    }

  # module.fpl-scheduler-db.null_resource.subnet_mappings[9] will be created
  + resource "null_resource" "subnet_mappings" {
      + id       = (known after apply)
      + triggers = {
          + "rule_name" = "shared-services-stg-aks01"
          + "subnet_id" = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/virtualNetworks/ss-stg-vnet/subnets/aks-01"
        }
    }

  # module.fpl-scheduler-db.null_resource.subnet_mappings[10] will be created
  + resource "null_resource" "subnet_mappings" {
      + id       = (known after apply)
      + triggers = {
          + "rule_name" = "bastion-nonprod-vnet"
          + "subnet_id" = "/subscriptions/b44eb479-9ae2-42e7-9c63-f3c599719b6f/resourceGroups/bastion-nonprod-rg/providers/Microsoft.Network/virtualNetworks/bastion-nonprod-vnet/subnets/bastion"
        }
    }

  # module.fpl-scheduler-db.null_resource.subnet_mappings[11] will be created
  + resource "null_resource" "subnet_mappings" {
      + id       = (known after apply)
      + triggers = {
          + "rule_name" = "idam-aat2-vnet"
          + "subnet_id" = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-idam-aat2/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-idam-aat2/subnets/core-infra-subnet-7-idam-aat2"
        }
    }

  # module.fpl-scheduler-db.null_resource.subnet_mappings[12] will be created
  + resource "null_resource" "subnet_mappings" {
      + id       = (known after apply)
      + triggers = {
          + "rule_name" = "shared-services-dev-aks00"
          + "subnet_id" = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/virtualNetworks/ss-dev-vnet/subnets/aks-00"
        }
    }

  # module.fpl-scheduler-db.null_resource.subnet_mappings[13] will be created
  + resource "null_resource" "subnet_mappings" {
      + id       = (known after apply)
      + triggers = {
          + "rule_name" = "shared-services-dev-aks01"
          + "subnet_id" = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/virtualNetworks/ss-dev-vnet/subnets/aks-01"
        }
    }

  # module.fpl-scheduler-db.random_string.password will be created
  + resource "random_string" "password" {
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = true
      + upper       = true
    }

  # module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/fpl-case-service-aat/providers/Microsoft.KeyVault/vaults/fpl-aat|fpl-aat"
        name                           = "fpl-aat"
        # (3 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

Plan: 19 to add, 3 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":4899,"Program":"tfcmt","SHA1":"","Vars":{}} -->